#-------------------  #1. Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.      #    *Примеры:*       #    - 5, 25 -> да #    - 4, 16 -> да #    - 25, 5 -> да #    - 8,9 -> нет  #value1 = int(input("Введите число 1: ")) #value2 = int(input("Введите число 2: "))  #if value1 > value2: #    value1, value2 = value2, value1  #if value1 ** 2 == value2: #    print(f"Верно, {value2} это {value1} в квадрате") #else: #    print(f"Не верно, {value2} это не {value1} в квадрате")  #-------------------  #2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.      #    Примеры:      #    - 1, 4, 8, 7, 5 -> 8 #    - 78, 55, 36, 90, 2 -> 90  #counter = 5 #value = 0 #while counter >= 1: #    counter-=1 #    inputer = int(input()) #    if value <= inputer: #        value = inputer #print(value)  #-------------------  #3. Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N      #    *Примеры:*       #    - 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5  #N = int(input()) #start = -N #while start <= N: #    print(start) #    start+=1  #-------------------  #4. Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.      #    *Примеры:*      #    - 6,78 -> 7 #    - 5 -> нет #    - 0,34 -> 3  #value = float(input())  #if int((value * 10) % 10) == 0: #    print("No") #else: #    print(int((value * 10) % 10))  #-------------------  #5. Напишите программу, которая принимает на вход число и проверяет, кратно ли оно 5 и 10 или 15, но не 30.  #number = int(input())  #if number % 30 != 0: #    if number % 5 == 0 or number % 10 == 0 or number % 15 == 0: #        print("Yes") #else: #    print("No")